In [8]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
df = pd.read_csv("C:/Users/dark1/PycharmProjects/soving/base/20210623/movies_title.csv")

In [15]:
df

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [17]:
df.head(5) # 필수명령 8가지

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [18]:
df.shape # 필수명령 8가지

(215981, 2)

In [19]:
df.columns # 필수명령 8가지

Index(['title', 'year'], dtype='object')

In [20]:
df.info # 필수명령 8가지

<bound method DataFrame.info of                           title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]>

In [21]:
df.tail(3) # 필수명령 8가지

               title  year
215978         E yue  2005
215979  Lakota Girls  2015
215980  The Sting II  1983

In [22]:
df.isnull().sum() # 필수명령 8가지

title    0
year     0
dtype: int64

In [24]:
df['title'].value_counts() # 필수명령 8가지

Hamlet                                  19
Carmen                                  14
Macbeth                                 14
The Three Musketeers                    12
Blood Money                             11
                                        ..
Gamunui yeonggwang 5: Gamunui Gwihan     1
La scogliera del peccato                 1
What's the Good of Being Good?           1
3 Wicked Witches                         1
Lost and Found in Armenia                1
Name: title, Length: 197575, dtype: int64

In [25]:
df.describe() # 필수명령 8가지

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [69]:
df.title.value_counts().shape[0] # 전체 영화는?

197575

In [47]:
df.sort_values('year', axis=0).head(2) # 가장 빠른 시기에 제작된 영화 2개

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [71]:
df[df['title'] == 'Hamlet'].shape[0] # 제목이 햄릿인 영화는 몇개?

19

In [77]:
df[df['title'] == 'Treasure Island'].shape[0] # 제목이 트레져 아일랜드인 영화는 몇개?

8

In [79]:
df[df['title'] == 'Treasure Island'].sort_values('year') # 제작년도 오름차순으로

                  title  year
191379  Treasure Island  1918
47769   Treasure Island  1920
192917  Treasure Island  1934
90175   Treasure Island  1950
104714  Treasure Island  1972
103646  Treasure Island  1973
190792  Treasure Island  1985
166675  Treasure Island  1999

In [85]:
df[(df['year'] >= 1950) & (df['year'] <= 1959)].shape[0] # 1950 1959 사이 영화 몇개?

12120